# 단축키

초록색: Edit mode(Enter키) / 파란색: Commande mode(ESC키)
* 셀 실행: Ctrl + Enter(실행 후 제자리) / Shift + Enter(실행 후 다음 셀)
* 셀 둘로 나누기: [edit mode] Ctrl + Shift + (-)
* 셀 추가: [command mode] A(위), B(아래)
* 셀 삭제: [command mode] DD
* 셀 복사: [command mode] C
* 셀 붙여넣기: [command mode] P
* 셀 잘라내기: [command mode] X
* 아래 셀과 합치기: [command mode] Shift + M
* code로 셀 타입 변경: [command mode] Y
* markdown으로 셀 타입 변경: [command mode] M
* 주석처리: Ctrl + / (원하는 행을 선택한 후) (다시 한번 더 하면 취소도 가능)
* 라인 넘버 설정: 메뉴 -> view -> Toggle line numbers 활성화
* 단축키 확인: 메뉴 -> help -> Keyboard shortcut
* 들여쓰기 취소: shift + tab

# 자료형

In [1]:
a = 9
b = 5

print(a // b)     # a/b의 몫
print(a % b)     # a/b의 나머지

1
4

In [5]:
data = {
    '일자' : '2020-01-01',
    '이름' : '홍길동',
    '전화번호' : '010-1234-5678'
}
data

{'일자': '2020-01-01', '이름': '홍길동', '전화번호': '010-1234-5678'}

In [6]:
data.keys()     # key값 조회

dict_keys(['일자', '이름', '전화번호'])

In [7]:
data.values()     # value값 조회

dict_values(['2020-01-01', '홍길동', '010-1234-5678'])

In [8]:
data.items()     # key, value 값 조회

dict_items([('일자', '2020-01-01'), ('이름', '홍길동'), ('전화번호', '010-1234-5678')])

In [9]:
data['이름']     # 특정 key값의 value 확인

'홍길동'

In [10]:
data['나이'] = 20     # 데이터 추가 등록
data

{'일자': '2020-01-01', '이름': '홍길동', '전화번호': '010-1234-5678', '나이': 20}

# numpy, pandas

In [14]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
import seaborn as sns

In [1]:
a = [1, 2, 3]
b = [4, 5, 6]

In [2]:
np.array(a)

array([1, 2, 3])

In [3]:
np.array([a, b])

array([[1, 2, 3],
       [4, 5, 6]])

* 판다스 구조
    * dataframe: 표 형태
        * index, columns
    * series: 하나의 속성을 가진 데이터 집합(dataframe에서 하나의 열 데이터)

In [4]:
pd.DataFrame(np.array([a, b]))

   0  1  2
0  1  2  3
1  4  5  6

In [5]:
pd.DataFrame([a, b])

   0  1  2
0  1  2  3
1  4  5  6

In [6]:
# column명과 index명 추가
pd.DataFrame([a, b], columns = ['a', 'b', 'c'], index = ['x', 'y'])

   a  b  c
x  1  2  3
y  4  5  6

In [7]:
pd.Series(a)

0    1
1    2
2    3
dtype: int64

# List

In [1]:
my_list = ['a', 'b', 'c']
my_list

['a', 'b', 'c']

In [2]:
my_list.append('d')
my_list

['a', 'b', 'c', 'd']

In [3]:
my_list[0]

'a'

In [4]:
my_list[0] = 'change'
my_list

['change', 'b', 'c', 'd']

In [5]:
nest = [1, 2, 3, [4, 5, ['here']]]
nest

[1, 2, 3, [4, 5, ['here']]]

In [6]:
nest[3]

[4, 5, ['here']]

In [7]:
nest[3][2]

['here']

In [8]:
nest[3][2][0]

'here'

In [4]:
list1 = ['원숭이', '코끼리', '바나나']
list2 = [2, 4, 6, 8, 10]

list1.append(list2)     # list1의 마지막 원소자리에 list2 추가
print(list1)
print(len(list1))     # list1의 원소 개수

['원숭이', '코끼리', '바나나', [2, 4, 6, 8, 10]]
4

# 반복문(for, while)

In [9]:
x = [1, 2, 3]

for a in x:
    print(a)

1
2
3

In [11]:
for i in range(10):
    print(i)

0
1
2
3
4
5
6
7
8
9

In [12]:
a = ['apple', 'orange', 'banana', 'melon']
b = [1, 0, 2]

for i in b:
    print(a[i])

orange
apple
banana

In [13]:
t = 0

while t < 10:
    print(t)
    t = t + 1

0
1
2
3
4
5
6
7
8
9

In [14]:
a = []
b = 1

while len(a) < 10:
    a.append(b)
    print(a)
    b = b + 3

[1]
[1, 4]
[1, 4, 7]
[1, 4, 7, 10]
[1, 4, 7, 10, 13]
[1, 4, 7, 10, 13, 16]
[1, 4, 7, 10, 13, 16, 19]
[1, 4, 7, 10, 13, 16, 19, 22]
[1, 4, 7, 10, 13, 16, 19, 22, 25]
[1, 4, 7, 10, 13, 16, 19, 22, 25, 28]

In [16]:
print(a)
len(a)

[1, 4, 7, 10, 13, 16, 19, 22, 25, 28]

10

# 조건문(if)

In [11]:
# 홀/짝 판단

n = 20

if n <= 0:
    print('1 이상의 자연수를 입력하세요')
elif n % 2 == 0:     # 2로 나눈 나머지가 0이면
    print('짝수입니다.')
else:
    print('홀수입니다')

짝수입니다.

In [13]:
# 크기 비교

shop_a = ['사과', '배', '파인애플']
shop_b = ['딸기', '포도', '사과', '배']

if len(shop_a) > len(shop_b):
    print('shop_a의 과일 종류가 더 많다')
elif len(shop_a) < len(shop_b):
    print('shop_b의 과일 종류가 더 많다')
else:
    print('두 매장에서 파는 과일의 종류 수는 동일하다')

shop_b의 과일 종류가 더 많다

In [15]:
# 포함 여부

shop_a = ['사과', '배', '파인애플']

if '딸기' in shop_a:
    print('shop_a에서 딸기를 판매한다')
else:
    print('shop_a에서 딸기를 판매하지 않는다')
    
if '포도' not in shop_a:
    print('shop_a에서 포도를 판매하지 않는다')
else:
    print('shop_a에서 포도를 판매한다')

shop_a에서 딸기를 판매하지 않는다
shop_a에서 포도를 판매하지 않는다

In [16]:
# 일치 여부

a = '태극기'
b = '태극기가 바람에 펄럭입니다'

if a == b:
    print('완전 동일')
elif a in b:
    print('a가 b에 포함된다')
else:
    print('다르다')

a가 b에 포함된다

In [19]:
# 문자열 포매팅

name = '홍길동'
sentence = f'안녕하세요. {name}님 만나서 반갑습니다.'
# sentence = '안녕하세요. {}님 만나서 반갑습니다.'.format(name)     # 이렇게 써도 똑같음. 위 버전이 최신이므로 되도록 위 버전으로 쓸 것

print(name)
print(sentence)

홍길동
안녕하세요. 홍길동님 만나서 반갑습니다.

In [20]:
# 문자열 포매팅 여러 개도 가능

month = '12월'
day = '25일'

sentence = f'오늘은 {month} {day}입니다.'
# sentence = '오늘은 {} {}입니다.'.format(month, day)

print(sentence)

오늘은 12월 25일입니다.

In [21]:
# 줄바꿈문자는 \n, 탭 문자는 \t

raw = '\n\t 태극기가 바람에 펄럭입니다. \n 하늘 높이 하늘 높이 펄럭입니다.'
print(raw)

	 태극기가 바람에 펄럭입니다.
 하늘 높이 하늘 높이 펄럭입니다.

In [22]:
# 문자열.strip()를 통해 문자열 시작과 끝 부분의 공백문자(줄바꿈, 띄어쓰기, 탭문자 등)을 제거할 수 있음

raw_strip = raw.strip()
print(raw_strip)

태극기가 바람에 펄럭입니다.
 하늘 높이 하늘 높이 펄럭입니다.

In [23]:
# 문자열.replace()를 통해 특정 문자열을 삭제하거나 변경 가능

raw_edit = raw_strip.replace('하늘 높이', '하늘높이')
print(raw_edit)

태극기가 바람에 펄럭입니다.
 하늘높이 하늘높이 펄럭입니다.

In [24]:
data = '미국/중국/일본/러시아/베트남/태국'
data.split('/')     # split을 이용해 특정 문자열을 기준으로 문자열을 나눌 수 있음. 결과는 리스트 타입

['미국', '중국', '일본', '러시아', '베트남', '태국']

# 함수 만들기(def)

In [62]:
def my_function(a):
    print(a)

my_function('hello')

hello

In [65]:
def hundred(x):
    print(x + 100)
    
y = hundred(10)

110

In [68]:
print(y)     # 함수에 return이 없으므로, y에 아무것도 저장되지 않음

None

In [69]:
def hundred(x):
    return x + 100

hundred(10)

110

In [70]:
y = hundred(10)

In [71]:
y     # 함수에 return이 있으면 y에 저장됨

110

In [72]:
def hap(x, y):
    return x + y

hap(3, 5)

8

In [74]:
def hap_ten(x, y = 10):     # y = 10으로 디폴트 값으로 미리 설정
    return x + y

hap_ten(3, 10)

13

In [75]:
hap_ten(3)     # y값을 안 넣어도 디폴트 값인 10으로 반영되어 계산됨

13

In [76]:
def hap_ten(x = 20, y = 10):     # 모든 변수에 디폴트값 설정도 가능
    return x + y

hap_ten(3, 9)

12

In [77]:
hap_ten()     # 모든 변수에 디폴트값이 설정되어 있으므로 괄호 안에 아무것도 안 써도 됨

30

In [78]:
def ten(x):
    if x > 10:
        print('large')
    else:
        print('small')
        
ten(30)

large

In [79]:
def plus_minus_ten(x):
    if x > 10:
        return x + 10
    else:
        return x - 10
    
plus_minus_ten(15)

25

In [7]:
def gob(a, b):
    gob = a * b
    text = f'{a} x {b} = {gob}'     # text = '{} x {} = {}'.format(a, b, gob)
    return text

In [11]:
a = 2
b = 8

print(gob(a, b))

2 x 8 = 16

In [12]:
# 구구단 출력

for i in [2, 3, 4, 5, 6, 7, 8, 9]:
    for j in [1, 2, 3, 4, 5, 6, 7, 8, 9]:
        print(gob(i, j))
    print('*' * 50)     # 단마다 구분하기 위한 구분선

2 x 1 = 2
2 x 2 = 4
2 x 3 = 6
2 x 4 = 8
2 x 5 = 10
2 x 6 = 12
2 x 7 = 14
2 x 8 = 16
2 x 9 = 18
**************************************************
3 x 1 = 3
3 x 2 = 6
3 x 3 = 9
3 x 4 = 12
3 x 5 = 15
3 x 6 = 18
3 x 7 = 21
3 x 8 = 24
3 x 9 = 27
**************************************************
4 x 1 = 4
4 x 2 = 8
4 x 3 = 12
4 x 4 = 16
4 x 5 = 20
4 x 6 = 24
4 x 7 = 28
4 x 8 = 32
4 x 9 = 36
**************************************************
5 x 1 = 5
5 x 2 = 10
5 x 3 = 15
5 x 4 = 20
5 x 5 = 25
5 x 6 = 30
5 x 7 = 35
5 x 8 = 40
5 x 9 = 45
**************************************************
6 x 1 = 6
6 x 2 = 12
6 x 3 = 18
6 x 4 = 24
6 x 5 = 30
6 x 6 = 36
6 x 7 = 42
6 x 8 = 48
6 x 9 = 54
**************************************************
7 x 1 = 7
7 x 2 = 14
7 x 3 = 21
7 x 4 = 28
7 x 5 = 35
7 x 6 = 42
7 x 7 = 49
7 x 8 = 56
7 x 9 = 63
**************************************************
8 x 1 = 8
8 x 2 = 16
8 x 3 = 24
8 x 4 = 32
8 x 5 = 40
8 x 6 = 48
8 x 7 = 56
8 x 8 = 64
8 x 9 = 72
**************************************************
9 x 1 = 9
9 x 2 = 18
9 x 3 = 27
9 x 4 = 36
9 x 5 = 45
9 x 6 = 54
9 x 7 = 63
9 x 8 = 72
9 x 9 = 81
**************************************************

In [80]:
import pandas as pd

data = pd.read_csv('galaxy.csv')
data.head()

,BuyItNow,startprice,carrier,color,productline,noDescription,charCountDescription,upperCaseDescription,sold
0,0,199.99,None,White,Galaxy_S9,contains description,0,0,1
1,0,235.00,None,NaN,Galaxy_Note9,contains description,0,0,0
2,0,199.99,NaN,NaN,Unknown,no description,100,2,0
3,1,175.00,AT&T,Space Gray,Galaxy_Note9,contains description,0,0,1
4,1,100.00,None,Space Gray,Galaxy_S8,contains description,0,0,1

In [81]:
# startprice가 .99로 끝나는 경우는 0.01을 더하고 100을 곱하고, .00으로 끝날 경우는 그냥 100을 곱하는 함수

def price(x):
    if x % 1 == 0:
        return x * 100
    else:
        return (x + 0.01) * 100
    
price(99.99)

10000.0

In [82]:
price(data['startprice'])     # 판다스 시리즈 혹은 데이터프레임을 바로 함수 안에 넣으면 하나의 숫자가 입력된게 아니므로 에러남

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

# 데이터분석 기본

In [17]:
temp = pd.read_excel('./데이터분석/인강/6. 러닝스푼즈_포트폴리오/파이썬 기초 강의자료/Ch2)Pandas_Basic/data/exam.xlsx')
temp     # 파일이 다른 폴더에 들어 있을 경우 pd.read_csv('./폴더명/파일명.csv') ./은 현재위치를 뜻함

   번호  국어   영어  수학
0  1번  70   80  75
1  2번  68   95  55
2  3번  90  100  95

In [18]:
data = temp.set_index('번호')     # 번호 칼럼을 인덱스로 전환 set_index()
data

    국어   영어  수학
번호
1번  70   80  75
2번  68   95  55
3번  90  100  95

In [19]:
# 파일을 불러올 때 미리 인덱스 지정 가능
# pd.read_excel('파일명', index_col = 칼럼정보)
# 칼럼정보에는 칼럼번호(0부터 시작) 또는 칼럼명 지정 가능

temp2 = pd.read_excel('./데이터분석/인강/6. 러닝스푼즈_포트폴리오/파이썬 기초 강의자료/Ch2)Pandas_Basic/data/exam.xlsx', index_col = 0)
temp2

    국어   영어  수학
번호
1번  70   80  75
2번  68   95  55
3번  90  100  95

#### 셀 선택하기
* df.iloc[row, column]: 인덱스번호로 선택(i가 인덱스를 뜻함)
* df.loc[row, column]: 이름으로 선택

In [20]:
data.iloc[0, 2]     # 0행 2열

75

In [21]:
data.loc['1번', '수학']

75

#### 복수 셀 선택
* df.loc[인덱스명, 컬럼명]
* df.iloc[인덱스번호, 칼럼번호]

In [38]:
data = pd.read_csv('ecommerce.csv')
data

,Email,Address,Avatar,Avg. Session Length,Time on App,Time on Website,Length of Membership,Yearly Amount Spent
0,mstephenson@fernandez.com,"835 Frank Tunnel\nWrightmouth, MI 82180-9605",Violet,34.497268,12.655651,39.577668,4.082621,587.951054
1,hduke@hotmail.com,"4547 Archer Common\nDiazchester, CA 06566-8576",DarkGreen,31.926272,11.109461,37.268959,2.664034,392.204933
2,pallen@yahoo.com,"24645 Valerie Unions Suite 582\nCobbborough, D...",Bisque,33.000915,11.330278,37.110597,4.104543,487.547505
3,riverarebecca@gmail.com,"1414 David Throughway\nPort Jason, OH 22070-1220",SaddleBrown,34.305557,13.717514,36.721283,3.120179,581.852344
4,mstephens@davidson-herman.com,"14023 Rodriguez Passage\nPort Jacobville, PR 3...",MediumAquaMarine,33.330673,12.795189,37.536653,4.446308,599.406092
...,...,...,...,...,...,...,...,...
495,lewisjessica@craig-evans.com,"4483 Jones Motorway Suite 872\nLake Jamiefurt,...",Tan,33.237660,13.566160,36.417985,3.746573,573.847438
496,katrina56@gmail.com,"172 Owen Divide Suite 497\nWest Richard, CA 19320",PaleVioletRed,34.702529,11.695736,37.190268,3.576526,529.049004
497,dale88@hotmail.com,"0787 Andrews Ranch Apt. 633\nSouth Chadburgh, ...",Cornsilk,32.646777,11.499409,38.332576,4.958264,551.620145
498,cwilson@hotmail.com,"680 Jennifer Lodge Apt. 808\nBrendachester, TX...",Teal,33.322501,12.391423,36.840086,2.336485,456.469510
499,hannahwilson@davidson.com,49791 Rachel Heights Apt. 898\nEast Drewboroug...,DarkMagenta,33.715981,12.418808,35.771016,2.735160,497.778642

In [19]:
type(data)     # type확인

pandas.core.frame.DataFrame

In [20]:
np.array(data)     # array형식으로 변환

array([['mstephenson@fernandez.com',
        '835 Frank Tunnel\nWrightmouth, MI 82180-9605', 'Violet', ...,
        39.57766801952616, 4.0826206329529615, 587.9510539684005],
       ['hduke@hotmail.com',
        '4547 Archer Common\nDiazchester, CA 06566-8576', 'DarkGreen',
        ..., 37.268958868297744, 2.66403418213262, 392.2049334443264],
       ['pallen@yahoo.com',
        '24645 Valerie Unions Suite 582\nCobbborough, DC 99414-7564',
        'Bisque', ..., 37.110597442120856, 4.104543202376424,
        487.54750486747207],
       ...,
       ['dale88@hotmail.com',
        '0787 Andrews Ranch Apt. 633\nSouth Chadburgh, TN 56128',
        'Cornsilk', ..., 38.33257633196044, 4.9582644726186995,
        551.6201454762477],
       ['cwilson@hotmail.com',
        '680 Jennifer Lodge Apt. 808\nBrendachester, TX 05000-5873',
        'Teal', ..., 36.840085729767004, 2.336484668112853,
        456.46951006629797],
       ['hannahwilson@davidson.com',
        '49791 Rachel Heights Apt. 898\nEast Drewborough, OR 55919-9528',
        'DarkMagenta', ..., 35.771016191612965, 2.7351595670822757,
        497.7786422156802]], dtype=object)

In [21]:
data['Yearly Amount Spent']     # 한 열만 가져오기

0      587.951054
1      392.204933
2      487.547505
3      581.852344
4      599.406092
          ...
495    573.847438
496    529.049004
497    551.620145
498    456.469510
499    497.778642
Name: Yearly Amount Spent, Length: 500, dtype: float64

In [22]:
type(data['Yearly Amount Spent'])     # 한 열만 가져오면 series 형식이 됨

pandas.core.series.Series

In [23]:
pd.DataFrame(data['Yearly Amount Spent'])     # 데이터프레임으로 변환

     Yearly Amount Spent
0             587.951054
1             392.204933
2             487.547505
3             581.852344
4             599.406092
..                   ...
495           573.847438
496           529.049004
497           551.620145
498           456.469510
499           497.778642

[500 rows x 1 columns]

In [24]:
data[['Time on App', 'Yearly Amount Spent']]   # 2개 이상의 칼럼을 가져오려면 대괄호[]를 2개 써야 함

     Time on App  Yearly Amount Spent
0      12.655651           587.951054
1      11.109461           392.204933
2      11.330278           487.547505
3      13.717514           581.852344
4      12.795189           599.406092
..           ...                  ...
495    13.566160           573.847438
496    11.695736           529.049004
497    11.499409           551.620145
498    12.391423           456.469510
499    12.418808           497.778642

[500 rows x 2 columns]

In [25]:
data.drop('Yearly Amount Spent', axis = 1)     # 기본적으로 행을 기준으로 drop하므로 칼럼을 제거하려면 axis = 1 을 써야 함

,Email,Address,Avatar,Avg. Session Length,Time on App,Time on Website,Length of Membership
0,mstephenson@fernandez.com,"835 Frank Tunnel\nWrightmouth, MI 82180-9605",Violet,34.497268,12.655651,39.577668,4.082621
1,hduke@hotmail.com,"4547 Archer Common\nDiazchester, CA 06566-8576",DarkGreen,31.926272,11.109461,37.268959,2.664034
2,pallen@yahoo.com,"24645 Valerie Unions Suite 582\nCobbborough, D...",Bisque,33.000915,11.330278,37.110597,4.104543
3,riverarebecca@gmail.com,"1414 David Throughway\nPort Jason, OH 22070-1220",SaddleBrown,34.305557,13.717514,36.721283,3.120179
4,mstephens@davidson-herman.com,"14023 Rodriguez Passage\nPort Jacobville, PR 3...",MediumAquaMarine,33.330673,12.795189,37.536653,4.446308
...,...,...,...,...,...,...,...
495,lewisjessica@craig-evans.com,"4483 Jones Motorway Suite 872\nLake Jamiefurt,...",Tan,33.237660,13.566160,36.417985,3.746573
496,katrina56@gmail.com,"172 Owen Divide Suite 497\nWest Richard, CA 19320",PaleVioletRed,34.702529,11.695736,37.190268,3.576526
497,dale88@hotmail.com,"0787 Andrews Ranch Apt. 633\nSouth Chadburgh, ...",Cornsilk,32.646777,11.499409,38.332576,4.958264
498,cwilson@hotmail.com,"680 Jennifer Lodge Apt. 808\nBrendachester, TX...",Teal,33.322501,12.391423,36.840086,2.336485
499,hannahwilson@davidson.com,49791 Rachel Heights Apt. 898\nEast Drewboroug...,DarkMagenta,33.715981,12.418808,35.771016,2.735160

In [26]:
data.drop(['Yearly Amount Spent','Email'], axis = 1)     # 칼럼2개 삭제

,Address,Avatar,Avg. Session Length,Time on App,Time on Website,Length of Membership
0,"835 Frank Tunnel\nWrightmouth, MI 82180-9605",Violet,34.497268,12.655651,39.577668,4.082621
1,"4547 Archer Common\nDiazchester, CA 06566-8576",DarkGreen,31.926272,11.109461,37.268959,2.664034
2,"24645 Valerie Unions Suite 582\nCobbborough, D...",Bisque,33.000915,11.330278,37.110597,4.104543
3,"1414 David Throughway\nPort Jason, OH 22070-1220",SaddleBrown,34.305557,13.717514,36.721283,3.120179
4,"14023 Rodriguez Passage\nPort Jacobville, PR 3...",MediumAquaMarine,33.330673,12.795189,37.536653,4.446308
...,...,...,...,...,...,...
495,"4483 Jones Motorway Suite 872\nLake Jamiefurt,...",Tan,33.237660,13.566160,36.417985,3.746573
496,"172 Owen Divide Suite 497\nWest Richard, CA 19320",PaleVioletRed,34.702529,11.695736,37.190268,3.576526
497,"0787 Andrews Ranch Apt. 633\nSouth Chadburgh, ...",Cornsilk,32.646777,11.499409,38.332576,4.958264
498,"680 Jennifer Lodge Apt. 808\nBrendachester, TX...",Teal,33.322501,12.391423,36.840086,2.336485
499,49791 Rachel Heights Apt. 898\nEast Drewboroug...,DarkMagenta,33.715981,12.418808,35.771016,2.735160

In [27]:
data.drop('Email', axis = 1, inplace = True)    # inplace = True를쓰면 data자체가 바뀜. 안쓰면 drop해도 원본데이터는 안바뀜
data.head()

,Address,Avatar,Avg. Session Length,Time on App,Time on Website,Length of Membership,Yearly Amount Spent
0,"835 Frank Tunnel\nWrightmouth, MI 82180-9605",Violet,34.497268,12.655651,39.577668,4.082621,587.951054
1,"4547 Archer Common\nDiazchester, CA 06566-8576",DarkGreen,31.926272,11.109461,37.268959,2.664034,392.204933
2,"24645 Valerie Unions Suite 582\nCobbborough, D...",Bisque,33.000915,11.330278,37.110597,4.104543,487.547505
3,"1414 David Throughway\nPort Jason, OH 22070-1220",SaddleBrown,34.305557,13.717514,36.721283,3.120179,581.852344
4,"14023 Rodriguez Passage\nPort Jacobville, PR 3...",MediumAquaMarine,33.330673,12.795189,37.536653,4.446308,599.406092

In [29]:
new_data  = data.head(10)
new_data

,Address,Avatar,Avg. Session Length,Time on App,Time on Website,Length of Membership,Yearly Amount Spent
0,"835 Frank Tunnel\nWrightmouth, MI 82180-9605",Violet,34.497268,12.655651,39.577668,4.082621,587.951054
1,"4547 Archer Common\nDiazchester, CA 06566-8576",DarkGreen,31.926272,11.109461,37.268959,2.664034,392.204933
2,"24645 Valerie Unions Suite 582\nCobbborough, D...",Bisque,33.000915,11.330278,37.110597,4.104543,487.547505
3,"1414 David Throughway\nPort Jason, OH 22070-1220",SaddleBrown,34.305557,13.717514,36.721283,3.120179,581.852344
4,"14023 Rodriguez Passage\nPort Jacobville, PR 3...",MediumAquaMarine,33.330673,12.795189,37.536653,4.446308,599.406092
5,"645 Martha Park Apt. 611\nJeffreychester, MN 6...",FloralWhite,33.871038,12.026925,34.476878,5.493507,637.102448
6,"68388 Reyes Lights Suite 692\nJosephbury, WV 9...",DarkSlateBlue,32.021596,11.366348,36.683776,4.685017,521.572175
7,Unit 6538 Box 8980\nDPO AP 09026-4941,Aqua,32.739143,12.351959,37.373359,4.434273,549.904146
8,"860 Lee Key\nWest Debra, SD 97450-0495",Salmon,33.987773,13.386235,37.534497,3.273434,570.200409
9,"PSC 2734, Box 5255\nAPO AA 98456-7482",Brown,31.936549,11.814128,37.145168,3.202806,427.199385

In [30]:
new_data.index = ['a','b','c','d','e','f','g','h','i','j']     # 인덱스 변경
new_data

,Address,Avatar,Avg. Session Length,Time on App,Time on Website,Length of Membership,Yearly Amount Spent
a,"835 Frank Tunnel\nWrightmouth, MI 82180-9605",Violet,34.497268,12.655651,39.577668,4.082621,587.951054
b,"4547 Archer Common\nDiazchester, CA 06566-8576",DarkGreen,31.926272,11.109461,37.268959,2.664034,392.204933
c,"24645 Valerie Unions Suite 582\nCobbborough, D...",Bisque,33.000915,11.330278,37.110597,4.104543,487.547505
d,"1414 David Throughway\nPort Jason, OH 22070-1220",SaddleBrown,34.305557,13.717514,36.721283,3.120179,581.852344
e,"14023 Rodriguez Passage\nPort Jacobville, PR 3...",MediumAquaMarine,33.330673,12.795189,37.536653,4.446308,599.406092
f,"645 Martha Park Apt. 611\nJeffreychester, MN 6...",FloralWhite,33.871038,12.026925,34.476878,5.493507,637.102448
g,"68388 Reyes Lights Suite 692\nJosephbury, WV 9...",DarkSlateBlue,32.021596,11.366348,36.683776,4.685017,521.572175
h,Unit 6538 Box 8980\nDPO AP 09026-4941,Aqua,32.739143,12.351959,37.373359,4.434273,549.904146
i,"860 Lee Key\nWest Debra, SD 97450-0495",Salmon,33.987773,13.386235,37.534497,3.273434,570.200409
j,"PSC 2734, Box 5255\nAPO AA 98456-7482",Brown,31.936549,11.814128,37.145168,3.202806,427.199385

In [31]:
new_data.loc['d']     # 행을 index할 때는 loc를 써야 함

Address                 1414 David Throughway\nPort Jason, OH 22070-1220
Avatar                                                       SaddleBrown
Avg. Session Length                                              34.3056
Time on App                                                      13.7175
Time on Website                                                  36.7213
Length of Membership                                             3.12018
Yearly Amount Spent                                              581.852
Name: d, dtype: object

In [32]:
new_data.loc['d':'h']

,Address,Avatar,Avg. Session Length,Time on App,Time on Website,Length of Membership,Yearly Amount Spent
d,"1414 David Throughway\nPort Jason, OH 22070-1220",SaddleBrown,34.305557,13.717514,36.721283,3.120179,581.852344
e,"14023 Rodriguez Passage\nPort Jacobville, PR 3...",MediumAquaMarine,33.330673,12.795189,37.536653,4.446308,599.406092
f,"645 Martha Park Apt. 611\nJeffreychester, MN 6...",FloralWhite,33.871038,12.026925,34.476878,5.493507,637.102448
g,"68388 Reyes Lights Suite 692\nJosephbury, WV 9...",DarkSlateBlue,32.021596,11.366348,36.683776,4.685017,521.572175
h,Unit 6538 Box 8980\nDPO AP 09026-4941,Aqua,32.739143,12.351959,37.373359,4.434273,549.904146

In [33]:
new_data.iloc[3]    # 행을 순서를 가지고 index할 때는 iloc라고 써야 함

Address                 1414 David Throughway\nPort Jason, OH 22070-1220
Avatar                                                       SaddleBrown
Avg. Session Length                                              34.3056
Time on App                                                      13.7175
Time on Website                                                  36.7213
Length of Membership                                             3.12018
Yearly Amount Spent                                              581.852
Name: d, dtype: object

In [34]:
new_data.iloc[3:8]

,Address,Avatar,Avg. Session Length,Time on App,Time on Website,Length of Membership,Yearly Amount Spent
d,"1414 David Throughway\nPort Jason, OH 22070-1220",SaddleBrown,34.305557,13.717514,36.721283,3.120179,581.852344
e,"14023 Rodriguez Passage\nPort Jacobville, PR 3...",MediumAquaMarine,33.330673,12.795189,37.536653,4.446308,599.406092
f,"645 Martha Park Apt. 611\nJeffreychester, MN 6...",FloralWhite,33.871038,12.026925,34.476878,5.493507,637.102448
g,"68388 Reyes Lights Suite 692\nJosephbury, WV 9...",DarkSlateBlue,32.021596,11.366348,36.683776,4.685017,521.572175
h,Unit 6538 Box 8980\nDPO AP 09026-4941,Aqua,32.739143,12.351959,37.373359,4.434273,549.904146

In [35]:
new_data.iloc[1:4, 0:3]     # 이렇게 하면 앞 부분은 행, 뒷 부분은 칼럼 index됨

,Address,Avatar,Avg. Session Length
b,"4547 Archer Common\nDiazchester, CA 06566-8576",DarkGreen,31.926272
c,"24645 Valerie Unions Suite 582\nCobbborough, D...",Bisque,33.000915
d,"1414 David Throughway\nPort Jason, OH 22070-1220",SaddleBrown,34.305557

In [36]:
new_data.iloc[:, 1:4]     # 이렇게 하면 앞부분(행)은 전부 불러오고, 뒷 부분 칼럼은 1~3까지 index됨

             Avatar  Avg. Session Length  Time on App
a            Violet            34.497268    12.655651
b         DarkGreen            31.926272    11.109461
c            Bisque            33.000915    11.330278
d       SaddleBrown            34.305557    13.717514
e  MediumAquaMarine            33.330673    12.795189
f       FloralWhite            33.871038    12.026925
g     DarkSlateBlue            32.021596    11.366348
h              Aqua            32.739143    12.351959
i            Salmon            33.987773    13.386235
j             Brown            31.936549    11.814128

In [39]:
data.head()     # 데이터 앞부분 5개만

,Email,Address,Avatar,Avg. Session Length,Time on App,Time on Website,Length of Membership,Yearly Amount Spent
0,mstephenson@fernandez.com,"835 Frank Tunnel\nWrightmouth, MI 82180-9605",Violet,34.497268,12.655651,39.577668,4.082621,587.951054
1,hduke@hotmail.com,"4547 Archer Common\nDiazchester, CA 06566-8576",DarkGreen,31.926272,11.109461,37.268959,2.664034,392.204933
2,pallen@yahoo.com,"24645 Valerie Unions Suite 582\nCobbborough, D...",Bisque,33.000915,11.330278,37.110597,4.104543,487.547505
3,riverarebecca@gmail.com,"1414 David Throughway\nPort Jason, OH 22070-1220",SaddleBrown,34.305557,13.717514,36.721283,3.120179,581.852344
4,mstephens@davidson-herman.com,"14023 Rodriguez Passage\nPort Jacobville, PR 3...",MediumAquaMarine,33.330673,12.795189,37.536653,4.446308,599.406092

In [40]:
data.tail()     # 데이터 뒷부분 5개만

,Email,Address,Avatar,Avg. Session Length,Time on App,Time on Website,Length of Membership,Yearly Amount Spent
495,lewisjessica@craig-evans.com,"4483 Jones Motorway Suite 872\nLake Jamiefurt,...",Tan,33.237660,13.566160,36.417985,3.746573,573.847438
496,katrina56@gmail.com,"172 Owen Divide Suite 497\nWest Richard, CA 19320",PaleVioletRed,34.702529,11.695736,37.190268,3.576526,529.049004
497,dale88@hotmail.com,"0787 Andrews Ranch Apt. 633\nSouth Chadburgh, ...",Cornsilk,32.646777,11.499409,38.332576,4.958264,551.620145
498,cwilson@hotmail.com,"680 Jennifer Lodge Apt. 808\nBrendachester, TX...",Teal,33.322501,12.391423,36.840086,2.336485,456.469510
499,hannahwilson@davidson.com,49791 Rachel Heights Apt. 898\nEast Drewboroug...,DarkMagenta,33.715981,12.418808,35.771016,2.735160,497.778642